Curso_CFD_OS_2019/cylinder2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  top
    {
      //type            symmetryPlane; 
	   type            zeroGradient;
    }

  left
    {
        type            zeroGradient;
    }

  right
    {
        type            fixedValue;
    	value		uniform 0;
    }


  bottom
    {    
      //type            symmetryPlane; 
      type            zeroGradient;
    }

  cylinder
    {    

      type            zeroGradient;
    }

  
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //


// ALT:


    
  // left
  //   {
  //     type fixedValue;
  //     value uniform 100;
  //   }
  // right
  //   {
  //     type fixedValue;
  //     value uniform 0 ;      
  //   }
